Revit 2024 API
PointIterator.MoveNext Method
 Increments the iterator to the next point in the collection.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public virtual bool MoveNext()
Visual Basic
Public Overridable Function MoveNext As Boolean
Visual C++
public:
virtual bool MoveNext()
Return Value
 True if there is another available point in this iterator. False if the iterator has completed all available points.
See Also
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace